from pathlib import Path
base_path = Path(__file__).parent.parent

# Пути к файлам логотипов и другим ресурсам
green_logo_path = str(base_path / "resourses" / 'images' / 'green_circle.png')
red_logo_path = str(base_path / "resourses" / 'images' / 'red_circle.png')
yellow_logo_path = str(base_path / "resourses" / 'images' / 'yellow_circle.png')
media_logo_path = str(base_path / "resourses" / 'images' / 'media_techtrans.png')

weights = str(base_path / 'weights' / 'best.pt')
svo = str(base_path / 'videos_svo' / 'HD2K_SN34222655_5.svo')
svo = None

img_size = 320    # Размер изображения для инференса
conf_thres = 0.4  # Порог уверенности объекта
iou_thres = 0.45  # Порог IOU для YOLO

depth_distance = 20
enable_gui = 1

polygon = False # Не трогать

# polygon_gl = [
#     [
#         [-1.164425594131744, -0.9560172934741379, -5.127998352050781], 
#         [2.2978240341923017, -1.0011578056723467, -5.291177272796631], 
#         [2.2978240341923017, -1.2722214016825548, -5.291177272796631], 
#         [-1.164425594131744, -1.2270808894843461, -5.127998352050781]
#     ], 
#     [
#         [2.2978240341923017, -1.0011578056723467, -5.291177272796631], 
#         [1.8399467516886103, -0.44802565002326955, -8.920463562011719], 
#         [1.8399467516886103, -0.7196928622711181, -8.920463562011719], 
#         [2.2978240341923017, -1.2728250179201952, -5.291177272796631]
#     ], 
#     [
#         [1.8399467516886103, -0.44802565002326955, -8.920463562011719], 
#         [-2.0753426240798003, -0.3797707164967001, -8.516510963439941], 
#         [-2.0753426240798003, -0.6587541902744711, -8.516510963439941], 
#         [1.8399467516886103, -0.7270091238010405, -8.920463562011719]
#     ], 
#     [
#         [-2.0753426240798003, -0.3797707164967001, -8.516510963439941], 
#         [-1.164425594131744, -0.9560172934741379, -5.127998352050781], 
#         [-1.164425594131744, -1.2356542725772264, -5.127998352050781], 
#         [-2.0753426240798003, -0.6594076955997885, -8.516510963439941]
#     ]
# ]

# polygon_cv = [array([173, 442]), array([257, 434]), array([245, 270]), array([148, 287])]

# # config.py или в начале вашего основного скрипта
# STATIC_POLYGON_COORDS = [
#     (429, 580), (1115, 583), (870, 429), (398, 423), (429, 580)  # Пример корректного определения координат
# ]

